todo/app/controllers/home_controller.rb

DELETE FROM "lists" WHERE "lists"."id" = ?  [["id", 30]]
SELECT "lists".* FROM "lists" WHERE "lists"."completed" = ?  [["completed", "t"]]
---
    def trash_all_marked
    	@trash_all_marked = List.where(:completed => true).destroy_all