todo/app/controllers/lists_controller.rb

SELECT "lists".* FROM "lists"
---
  def index
    @list = List.new
    @lists = List.all

INSERT INTO "lists" ("description", "created_at", "updated_at") VALUES (?, ?, ?)  [["description", "Workout"], ["created_at", "2018-06-06 22:50:53.142543"], ["updated_at", "2018-06-06 22:50:53.142543"]]
---
  def create
    @list = List.new(list_params)

    respond_to do |format|
      if @list.save

UPDATE "lists" SET "completed" = ?, "updated_at" = ? WHERE "lists"."id" = ?  [["completed", "t"], ["updated_at", "2018-06-06 22:50:55.029789"], ["id", 30]]
---
  def update
    respond_to do |format|
      if @list.update(list_params)

SELECT  "lists".* FROM "lists" WHERE "lists"."id" = ? LIMIT 1  [["id", 30]]
---
    def set_list
      @list = List.find(params[:id])